---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.ItemIndex
source: html/26ff332f-e5c0-a69a-63b1-c49d309d9b18.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.ItemIndex Property

The index of this item in its associated RebarContainer.

## Syntax (C#)
```csharp
public int ItemIndex { get; }
```